Revit 2027 API
RebarSpliceByRulesResult.Error Property
 Identifies the error that occured during the splice by rules operation. In case of success the value of this property will be Success.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSpliceByRulesError Error { get; }
Public ReadOnly Property Error As RebarSpliceByRulesError
	Get
public:
property RebarSpliceByRulesError Error {
	RebarSpliceByRulesError get ();
}
member Error : RebarSpliceByRulesError with get
Property Value
RebarSpliceByRulesError
See Also
Reference
RebarSpliceByRulesResult Class
Autodesk.Revit.DB.Structure Namespace